src/wwwroot/SoapSchema/UyeBilgisiSorgula.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:UyeBilgisiSorgula">
  <soapenv:Header />
  <soapenv:Body>
    <urn:UyeBilgisiSorgula soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
      <kullanicino xsi:type="xsd:string">{{kullanicino}}</kullanicino>
      <kullaniciadi xsi:type="xsd:string">{{kullaniciadi}}</kullaniciadi>
      <sifre xsi:type="xsd:string">{{sifre}}</sifre>
    </urn:UyeBilgisiSorgula>
  </soapenv:Body>
</soapenv:Envelope>